--ACID (Atomicity, Consistency, Isolation, Durability)
--Атомарность (Atomicity) - ни какая транзакция не будет зафиксирована
-- в системе частично, будет либо выполнено все, либо ничего.
-- USE [2023_IB_1]
-- Удаление записей в таблице
 TRUNCATE TABLE [Счета]
 GO
 --Добавление строк в таблицу
 INSERT INTO  [Счета]([Номер счета], [Владелец], [Баланс])
 VALUES ('1111111111111',N'Иванов',1000),
		('2222222222222',N'Петров',0)
GO

SELECT N'До начала транзакции' as [Cостояние]
	,*
	, @@SPID as [Процесс]
	, @@TRANCOUNT  as [Количество транзакций]
	FROM [Счета]

BEGIN TRANSACTION перевод_денег;

UPDATE [Счета]
SET [Баланс]-=1000
WHERE [Владелец]=N'Иванов'

SELECT N'Транзакция после первого UPDATE' as [Cостояние]
	,*
	, @@SPID as [Процесс] -- Идентификатор сеанса
	, @@TRANCOUNT  as [Количество транзакций]
	FROM [Счета]

-- в другом сеансе работы произошел сбой 11-2

UPDATE [Счета]
SET [Баланс]+=1000
WHERE [Владелец]=N'Петров'

COMMIT TRANSACTION перевод_денег;

SELECT N'После окончания транзакции' as [Cостояние]
	,*
	, @@SPID as [Процесс] -- Идентификатор сеанса
	, @@TRANCOUNT  as [Количество транзакций]
	FROM [Счета]
